---
kind: property
id: P:Autodesk.Revit.UI.RibbonItem.Name
source: html/07794356-fa07-1071-47f0-a1b13ee47f40.htm
---
# Autodesk.Revit.UI.RibbonItem.Name Property

The name of the item.

## Syntax (C#)
```csharp
public string Name { get; internal set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when setting the text to empty or to the string contains "%".